MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx130f128l.h
extern volatile __U3MODEbits_t U3MODEbits __asm__ ("U3MODE") __attribute__((section("sfrs"), address(0xBF806400)));
#define U5aMODE U5aMODE
extern volatile uint32_t   U5aMODE __attribute__((section("sfrs"), address(0xBF806400)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U5aMODEbits_t;
extern volatile __U5aMODEbits_t U5aMODEbits __asm__ ("U5aMODE") __attribute__((section("sfrs"), address(0xBF806400)));
extern volatile uint32_t        U3MODECLR __attribute__((section("sfrs"),address(0xBF806404)));
extern volatile uint32_t        U5aMODECLR __attribute__((section("sfrs"),address(0xBF806404)));
extern volatile uint32_t        U3MODESET __attribute__((section("sfrs"),address(0xBF806408)));
extern volatile uint32_t        U5aMODESET __attribute__((section("sfrs"),address(0xBF806408)));
extern volatile uint32_t        U3MODEINV __attribute__((section("sfrs"),address(0xBF80640C)));
extern volatile uint32_t        U5aMODEINV __attribute__((section("sfrs"),address(0xBF80640C)));
#define U3STA U3STA
extern volatile uint32_t   U3STA __attribute__((section("sfrs"), address(0xBF806410)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U3STAbits_t;
extern volatile __U3STAbits_t U3STAbits __asm__ ("U3STA") __attribute__((section("sfrs"), address(0xBF806410)));
#define U5aSTA U5aSTA
extern volatile uint32_t   U5aSTA __attribute__((section("sfrs"), address(0xBF806410)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U5aSTAbits_t;
extern volatile __U5aSTAbits_t U5aSTAbits __asm__ ("U5aSTA") __attribute__((section("sfrs"), address(0xBF806410)));
extern volatile uint32_t        U3STACLR __attribute__((section("sfrs"),address(0xBF806414)));
extern volatile uint32_t        U5aSTACLR __attribute__((section("sfrs"),address(0xBF806414)));
extern volatile uint32_t        U3STASET __attribute__((section("sfrs"),address(0xBF806418)));
extern volatile uint32_t        U5aSTASET __attribute__((section("sfrs"),address(0xBF806418)));
extern volatile uint32_t        U3STAINV __attribute__((section("sfrs"),address(0xBF80641C)));
extern volatile uint32_t        U5aSTAINV __attribute__((section("sfrs"),address(0xBF80641C)));
#define U3TXREG U3TXREG
extern volatile uint32_t   U3TXREG __attribute__((section("sfrs"), address(0xBF806420)));
#define U5aTXREG U5aTXREG
extern volatile uint32_t   U5aTXREG __attribute__((section("sfrs"), address(0xBF806420)));
#define U3RXREG U3RXREG
extern volatile uint32_t   U3RXREG __attribute__((section("sfrs"), address(0xBF806430)));
#define U5aRXREG U5aRXREG
extern volatile uint32_t   U5aRXREG __attribute__((section("sfrs"), address(0xBF806430)));
#define U3BRG U3BRG
extern volatile uint32_t   U3BRG __attribute__((section("sfrs"), address(0xBF806440)));
#define U5aBRG U5aBRG
extern volatile uint32_t   U5aBRG __attribute__((section("sfrs"), address(0xBF806440)));
extern volatile uint32_t        U3BRGCLR __attribute__((section("sfrs"),address(0xBF806444)));
extern volatile uint32_t        U5aBRGCLR __attribute__((section("sfrs"),address(0xBF806444)));
extern volatile uint32_t        U3BRGSET __attribute__((section("sfrs"),address(0xBF806448)));
extern volatile uint32_t        U5aBRGSET __attribute__((section("sfrs"),address(0xBF806448)));
extern volatile uint32_t        U3BRGINV __attribute__((section("sfrs"),address(0xBF80644C)));
extern volatile uint32_t        U5aBRGINV __attribute__((section("sfrs"),address(0xBF80644C)));
#define U4MODE U4MODE
extern volatile uint32_t   U4MODE __attribute__((section("sfrs"), address(0xBF806600)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U4MODEbits_t;
extern volatile __U4MODEbits_t U4MODEbits __asm__ ("U4MODE") __attribute__((section("sfrs"), address(0xBF806600)));
#define U7AMODE U7AMODE
extern volatile uint32_t   U7AMODE __attribute__((section("sfrs"), address(0xBF806600)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U7AMODEbits_t;
