MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx130f128l.h
extern volatile __RPE4Rbits_t RPE4Rbits __asm__ ("RPE4R") __attribute__((section("sfrs"), address(0xBF80FC10)));
#define RPE5R RPE5R
extern volatile uint32_t   RPE5R __attribute__((section("sfrs"), address(0xBF80FC14)));
typedef struct {
  uint32_t RPE5R:4;
} __RPE5Rbits_t;
extern volatile __RPE5Rbits_t RPE5Rbits __asm__ ("RPE5R") __attribute__((section("sfrs"), address(0xBF80FC14)));
#define RPE6R RPE6R
extern volatile uint32_t   RPE6R __attribute__((section("sfrs"), address(0xBF80FC18)));
typedef struct {
  uint32_t RPE6R:4;
} __RPE6Rbits_t;
extern volatile __RPE6Rbits_t RPE6Rbits __asm__ ("RPE6R") __attribute__((section("sfrs"), address(0xBF80FC18)));
#define RPE7R RPE7R
extern volatile uint32_t   RPE7R __attribute__((section("sfrs"), address(0xBF80FC1C)));
typedef struct {
  uint32_t RPE7R:4;
} __RPE7Rbits_t;
extern volatile __RPE7Rbits_t RPE7Rbits __asm__ ("RPE7R") __attribute__((section("sfrs"), address(0xBF80FC1C)));
#define RPE8R RPE8R
extern volatile uint32_t   RPE8R __attribute__((section("sfrs"), address(0xBF80FC20)));
typedef struct {
  uint32_t RPE8R:4;
} __RPE8Rbits_t;
extern volatile __RPE8Rbits_t RPE8Rbits __asm__ ("RPE8R") __attribute__((section("sfrs"), address(0xBF80FC20)));
#define RPE9R RPE9R
extern volatile uint32_t   RPE9R __attribute__((section("sfrs"), address(0xBF80FC24)));
typedef struct {
  uint32_t RPE9R:4;
} __RPE9Rbits_t;
extern volatile __RPE9Rbits_t RPE9Rbits __asm__ ("RPE9R") __attribute__((section("sfrs"), address(0xBF80FC24)));
#define RPE10R RPE10R
extern volatile uint32_t   RPE10R __attribute__((section("sfrs"), address(0xBF80FC28)));
typedef struct {
  uint32_t RPE10R:4;
} __RPE10Rbits_t;
extern volatile __RPE10Rbits_t RPE10Rbits __asm__ ("RPE10R") __attribute__((section("sfrs"), address(0xBF80FC28)));
#define RPE11R RPE11R
extern volatile uint32_t   RPE11R __attribute__((section("sfrs"), address(0xBF80FC2C)));
typedef struct {
  uint32_t RPE11R:4;
} __RPE11Rbits_t;
extern volatile __RPE11Rbits_t RPE11Rbits __asm__ ("RPE11R") __attribute__((section("sfrs"), address(0xBF80FC2C)));
#define RPE12R RPE12R
extern volatile uint32_t   RPE12R __attribute__((section("sfrs"), address(0xBF80FC30)));
typedef struct {
  uint32_t RPE12R:4;
} __RPE12Rbits_t;
extern volatile __RPE12Rbits_t RPE12Rbits __asm__ ("RPE12R") __attribute__((section("sfrs"), address(0xBF80FC30)));
#define RPE13R RPE13R
extern volatile uint32_t   RPE13R __attribute__((section("sfrs"), address(0xBF80FC34)));
typedef struct {
  uint32_t RPE13R:4;
} __RPE13Rbits_t;
extern volatile __RPE13Rbits_t RPE13Rbits __asm__ ("RPE13R") __attribute__((section("sfrs"), address(0xBF80FC34)));
#define RPE14R RPE14R
extern volatile uint32_t   RPE14R __attribute__((section("sfrs"), address(0xBF80FC38)));
typedef struct {
  uint32_t RPE14R:4;
} __RPE14Rbits_t;
extern volatile __RPE14Rbits_t RPE14Rbits __asm__ ("RPE14R") __attribute__((section("sfrs"), address(0xBF80FC38)));
#define RPE15R RPE15R
extern volatile uint32_t   RPE15R __attribute__((section("sfrs"), address(0xBF80FC3C)));
typedef struct {
  uint32_t RPE15R:4;
} __RPE15Rbits_t;
extern volatile __RPE15Rbits_t RPE15Rbits __asm__ ("RPE15R") __attribute__((section("sfrs"), address(0xBF80FC3C)));
#define RPF0R RPF0R
extern volatile uint32_t   RPF0R __attribute__((section("sfrs"), address(0xBF80FC40)));
typedef struct {
  uint32_t RPF0R:4;
} __RPF0Rbits_t;
extern volatile __RPF0Rbits_t RPF0Rbits __asm__ ("RPF0R") __attribute__((section("sfrs"), address(0xBF80FC40)));
#define RPF1R RPF1R
extern volatile uint32_t   RPF1R __attribute__((section("sfrs"), address(0xBF80FC44)));
typedef struct {
  uint32_t RPF1R:4;
} __RPF1Rbits_t;
extern volatile __RPF1Rbits_t RPF1Rbits __asm__ ("RPF1R") __attribute__((section("sfrs"), address(0xBF80FC44)));
#define RPF2R RPF2R
extern volatile uint32_t   RPF2R __attribute__((section("sfrs"), address(0xBF80FC48)));
typedef struct {
  uint32_t RPF2R:4;
} __RPF2Rbits_t;
extern volatile __RPF2Rbits_t RPF2Rbits __asm__ ("RPF2R") __attribute__((section("sfrs"), address(0xBF80FC48)));
#define RPF3R RPF3R
extern volatile uint32_t   RPF3R __attribute__((section("sfrs"), address(0xBF80FC4C)));
typedef struct {
  uint32_t RPF3R:4;
} __RPF3Rbits_t;
extern volatile __RPF3Rbits_t RPF3Rbits __asm__ ("RPF3R") __attribute__((section("sfrs"), address(0xBF80FC4C)));
#define RPF4R RPF4R
extern volatile uint32_t   RPF4R __attribute__((section("sfrs"), address(0xBF80FC50)));
typedef struct {
  uint32_t RPF4R:4;
} __RPF4Rbits_t;
extern volatile __RPF4Rbits_t RPF4Rbits __asm__ ("RPF4R") __attribute__((section("sfrs"), address(0xBF80FC50)));
#define RPF5R RPF5R
extern volatile uint32_t   RPF5R __attribute__((section("sfrs"), address(0xBF80FC54)));
typedef struct {
  uint32_t RPF5R:4;
} __RPF5Rbits_t;
extern volatile __RPF5Rbits_t RPF5Rbits __asm__ ("RPF5R") __attribute__((section("sfrs"), address(0xBF80FC54)));
#define RPF6R RPF6R
extern volatile uint32_t   RPF6R __attribute__((section("sfrs"), address(0xBF80FC58)));
typedef struct {
  uint32_t RPF6R:4;
} __RPF6Rbits_t;
extern volatile __RPF6Rbits_t RPF6Rbits __asm__ ("RPF6R") __attribute__((section("sfrs"), address(0xBF80FC58)));
#define RPF7R RPF7R
extern volatile uint32_t   RPF7R __attribute__((section("sfrs"), address(0xBF80FC5C)));
typedef struct {
  uint32_t RPF7R:4;
} __RPF7Rbits_t;
extern volatile __RPF7Rbits_t RPF7Rbits __asm__ ("RPF7R") __attribute__((section("sfrs"), address(0xBF80FC5C)));
#define RPF8R RPF8R
extern volatile uint32_t   RPF8R __attribute__((section("sfrs"), address(0xBF80FC60)));
typedef struct {
  uint32_t RPF8R:4;
} __RPF8Rbits_t;
extern volatile __RPF8Rbits_t RPF8Rbits __asm__ ("RPF8R") __attribute__((section("sfrs"), address(0xBF80FC60)));
#define RPF9R RPF9R
extern volatile uint32_t   RPF9R __attribute__((section("sfrs"), address(0xBF80FC64)));
typedef struct {
  uint32_t RPF9R:4;
} __RPF9Rbits_t;
extern volatile __RPF9Rbits_t RPF9Rbits __asm__ ("RPF9R") __attribute__((section("sfrs"), address(0xBF80FC64)));
#define RPF10R RPF10R
extern volatile uint32_t   RPF10R __attribute__((section("sfrs"), address(0xBF80FC68)));
typedef struct {
  uint32_t RPF10R:4;
} __RPF10Rbits_t;
extern volatile __RPF10Rbits_t RPF10Rbits __asm__ ("RPF10R") __attribute__((section("sfrs"), address(0xBF80FC68)));
#define RPF11R RPF11R
extern volatile uint32_t   RPF11R __attribute__((section("sfrs"), address(0xBF80FC6C)));
typedef struct {
  uint32_t RPF11R:4;
} __RPF11Rbits_t;
